[{
  "_id": {
    "$oid": "63e4cd45d88823d386b864b6"
  },
  "post": "Thuật toán Quick Sort\n\nLà thuật toán sắp xếp dựa trên kỹ thuật chia để trị. Thuật toán được mô tả như sau:\n\n    Base case: nếu dãy chỉ còn không quá 1 phần tử thì dãy đó đã được sắp xếp => không cần thao tác thêm gì cả\n    Chia: ở thao tác này bao gồm 2 công việc:\n        Chọn 1 phần tử trong dãy làm phần tử chốt p (pivot)\n        Phân đoạn: chia dãy đã cho thành 2 dãy con, dãy con trái(L) sẽ gồm những phần tử nhỏ hơn phần tử chốt và dãy con phải(R) là những phần tử lớn hơn phần tử chốt.\n\n    Trị: lặp lại 1 cách đệ quy thuật toán với 2 dãy con trái và phải\n    Tổng hợp: dãy được sắp xếp L,p,R\n",
  "title": " Tìm hiểu thuật toán Quick Sort ",
  "img": "https://images.viblo.asia/a1e36eff-9fc6-4569-9466-479b169c92f7.png"
},{
  "_id": {
    "$oid": "63e9aab6d88823d386b864bd"
  },
  "post": "Trong bài viết này chúng ta sẽ nghiên cứu những vấn đề sau:\n\n    Sự cần thiết phải phân tích các giải thuật\n    Thời gian thực hiện chương trình\n    Tỷ suất tăng và độ phức tạp của giải thuật\n    Tính thời gian thực hiện chương trình\n",
  "title": " Kỹ Thuật Phân Tích Giải Thuật ",
  "img": "https://images.viblo.asia/594e148b-c0d7-4957-9cc0-d4cc11175755.gif"
},{
  "_id": {
    "$oid": "63e9aae2d88823d386b864be"
  },
  "post": "1. Cấu trúc dữ liệu đồ thị\n\nMột đồ thị là một dạng biểu diễn hình ảnh của một tập các đối tượng, trong đó các cặp đối tượng được kết nối bởi các link.\n\nCác đối tượng được nối liền nhau được biểu diễn bởi các điểm được gọi là các đỉnh (vertices), và các link mà kết nối các đỉnh với nhau được gọi là các cạnh (edges).\n\nNói chung, một đồ thị là một cặp các tập hợp (V, E), trong đó V là tập các đỉnh và E là tập các cạnh mà kết nối các cặp điểm. Bạn theo dõi đồ thị sau:",
  "title": " Cấu trúc dữ liệu và giải thuật - Cấu trúc dữ liệu đồ thị (Graph) ",
  "img": "https://images.viblo.asia/7f3d723a-d67a-4529-8b56-882ea7283cf2.jpg"
},{
  "_id": {
    "$oid": "63e9ab04d88823d386b864bf"
  },
  "post": "Giải thuật tìm kiếm theo chiều sâu còn được gọi là giải thuật tìm kiếm ưu tiên chiều sâu, là giải thuật duyệt hoặc tìm kiếm trên một cây hoặc một đồ thị và sử dụng stack (ngăn xếp) để ghi nhớ đỉnh liền kề để bắt đầu việc tìm kiếm khi không gặp được đỉnh liền kề trong bất kỳ vòng lặp nào.\n\nGiải thuật tiếp tục cho tới khi gặp được đỉnh cần tìm hoặc tới một nút không có con. Khi đó giải thuật quay lui về đỉnh vừa mới tìm kiếm ở bước trước.",
  "title": "Giải thuật tìm kiếm theo chiều sâu(Depth First Search)",
  "img": "https://images.viblo.asia/e8046133-c9cd-44b7-9307-0acb3e8de80a.jpg"
},{
  "_id": {
    "$oid": "63e9fe7c23243ca97a4fbc04"
  },
  "title": "Cùng nói về “Đông Tà Tây Độc” (1994) của Vương Gia Vệ",
  "post": "When to Delete branches  It is common for a Git repo to have different branches. They are a great way to work on different features and fixes while isolating the new code from the main codebase.  Repos often have a main branch for the main codebase and developers create other branches to work on different features.",
  "img": "https://cdn-media-2.freecodecamp.org/w1280/5f9c9e53740569d1a4ca3c89.jpg",
  "createdAt": {
    "$date": {
      "$numberLong": "1676279420240"
    }
  },
  "updatedAt": {
    "$date": {
      "$numberLong": "1676279420240"
    }
  },
  "slug": "cung-noi-ve-dong-ta-tay-doc-1994-cua-vuong-gia-ve",
  "__v": 0
},{
  "_id": {
    "$oid": "63ea0d34bf7744e3211c26e8"
  },
  "title": " Nếu bạn là đàn ông",
  "post": "Bài này hay copy lại để dành, nội dung nguyên bản của Tiến sĩ Lý Khai Phục (Kai-Fu Lee) – ông từng là Phó tổng giám đốc Microsoft toàn cầu trong thập kỷ 90, rồi đảm nhận Phó tổng giám đốc Google châu Á năm 2005. Ông sinh năm 1961 tại Đài Bắc, thường gây sóng gió bởi những phát ngôn sáng suốt nhưng ngôn từ trần trụi khó nghe.  —  Nếu bạn là đàn ông, nếu bạn đã hai mươi, nhưng bạn chưa hai lăm tuổi, bạn buộc phải tìm được một thứ gì đó ngoài tình yêu, giúp đôi chân bạn đứng vững vàng trong cuộc đời này. Bạn phải bắt đầu nghĩ cách để kiếm ĐỦ và sống ĐƯỢC.  Tôi chưa từng bao giờ nghĩ bằng cấp là thứ quan trọng, thiên tài với danh nhân đâu phải từ lò luyện và trường lớp mà ra. Nhưng nếu bạn không học tới nơi tới chốn, thì dù có đi làm cửu vạn, ngay cả bao cát cũng sợ rằng chẳng biết cách mà vác.  Bạn buộc phải làm cho những suy nghĩ văn vẻ và cảm xúc màu mè thị dân của mình dần trở thành lối tư duy sáng sủa, rõ ràng và những ngôn từ giản tiện ngắn gọn. Bởi những thứ màu mè và bồng bột sẽ không thể tồn tại lâu. Bạn phải biết rằng, những sự thích thú khi khi đọc văn hay, nghe lời bay bướm mang lại sẽ chẳng mấy giá trị, trong khi thứ quan trọng nhất lại nằm ở trí tuệ, tinh thần, tâm hồn, nội dung, tư duy của bạn.  Là đàn ông, làm ơn đừng đọc văn của những nhà văn nữ cùng thời với bạn.  Là đàn ông, làm ơn đừng trách người khác, đừng nhỏ nhặt, làm ra vẻ đáng thương.  Làm ơn đừng nghĩ đến cái gì là viết về cái đó.  Và chớ tiếc rẻ đôi chút cảm động bé nhỏ, đôi chút thương xót nhỏ nhoi.  Bạn phải tin vào cái đẹp, tin vào hơi ấm, vào lòng tin con người, sự tự trọng của mỗi người, bạn hãy giữ gìn những phẩm chất xưa cũ này. Tôi không muốn bạn bốc đồng, vô vị, mù mờ, chà đạp chính mình và làm thương tổn người khác. Bạn không nên nhào nặn đời bạn thành một đống hỗn độn tổng hợp đủ thứ.  Khi bạn thay đổi con người bạn, hãy cố nâng niu những giá trị bản thân, cho dù bạn biết rõ, không phải ai cũng ưa những gì bạn đang có.  Làm ơn đừng chấp nhận thỏa hiệp với những con người đang ngụy trang là họ thức thời, cấp tiến. Họ chỉ là những kẻ vô công rồi nghề đang tìm cách biện minh cho sự thua kém của bản thân họ. Sự mạnh mẽ, bản lĩnh đàn ông nằm ở tận trong trái tim bạn, bạn có sức mạnh và vẻ đẹp từ trong tim, từ niềm tin mà dù thời gian và tuổi trẻ có trôi qua cũng không khuất phục được.  Bạn không có quyền ngồi trong cái tháp ngà của trường học, rồi bảo tôi yêu thế giới này tươi đẹp. Bạn phải nhìn thấy cái đen tối của thế giới, sự bẩn thỉu của cuộc đời, sự xấu xa của con người, sau đó mới nói rằng tôi vẫn yêu thế giới này, tôi vẫn yêu cuộc sống và tôi sống.  Tuổi trẻ ngắn ngủi thế, nhưng đừng sợ tuổi già.  Đôi khi, bạn có thể dừng lại nghỉ ngơi, nhưng đừng quỳ xuống.  Khi đi một con đường, bạn chớ ngoái đầu nhìn lại, hoặc tự hỏi, mình đang làm cái gì?  Khi đau và nhục, đàn ông có thể khóc và gào. Khóc đi, rồi rửa mặt, vỗ má mình, rồi áp má mình để trên gương mặt bạn có một nụ cười. Chứ bạn đừng dụi mắt hay lấy tay lau nước mắt. Bởi có thể sớm mai bạn sẽ mang một đôi mắt trũng và sưng vì khóc. Chớ để sớm mai ai cũng nhận ra bạn từng khóc.  Đàn ông hãy xác định cho mình một mục tiêu xa hơn và một lộ trình dài hơn. Hãy nhớ thỉnh thoảng ngửa đầu nhìn trời xanh, và lúc nhìn lên trời xanh hãy nhớ cúi xuống nhìn đất dưới chân mình.  Vào bất kỳ lúc nào, bất kỳ người nào hỏi bạn, bạn yêu mấy lần, đáp án của bạn phải luôn là Hai.  Một lần, cô ấy yêu tôi nhưng tôi không cảm xúc, một lần là tôi yêu cô ấy nhưng không được đáp lại. Hãy luôn nhớ rằng, tình yêu đẹp vẫn luôn đang đợi bạn ở lần yêu sau. Nên đừng luyến tiếc, đừng để một người đàn bà nào có cơ hội làm bạn bị tổn thương tới lần thứ hai.  Làm đàn ông, đừng giao du với văn nghệ sĩ hay bọn văn sĩ trẻ, cũng như đừng làm bạn với những kẻ bất đắc chí, thiếu tâm huyết với đời, cũng tuyệt đối không được bạn bè với những người đàn ông không có nghề nghiệp chính thức, kiêm quá nhiều nghề.  Cũng đừng yêu người phụ nữ nào hy sinh vì bạn. Khi có một cô nàng tự chà đạp bản thân nàng, tự hy sinh, tự chịu thiệt vì bạn, bạn chớ nên vì thế mà cảm động hoặc yêu kẻ lụy tình ấy. Bởi một người đàn ông nghiện hút trộm cắp đầy mình thân với bạn, có thể kẻ nghiện hút trộm cắp tiếp theo sẽ là chính bản thân bạn. Tình yêu cũng tương tự như vậy, khi một người phụ nữ vì yêu mà cầm dao cứa tay mình đau, có thể kẻ tiếp theo bị nàng cứa chính là bạn.  Không bao giờ đặt niềm tin vào một gã đàn ông chỉ định giao du với mình bạn chứ không cho bạn biết hắn đang chơi bời với những bạn bè nào khác.  Khi một cô nàng định gọi bạn là “anh yêu, baby, chồng yêu ơi”, bạn hãy bắt buộc cô nàng gọi bạn bằng tên bạn, bởi bạn là một người đàn ông, bạn không phải thú cưng của ai.  Khi một người đàn ông hoặc một người đàn bà tự nhiên không tới tìm bạn nữa, bạn hãy dứt khoát đừng gọi tới làm phiền họ.  Đừng tin những kẻ dùng tiểu xảo trong tình yêu. Và đừng ác miệng sau khi chia tay người tình. Nghe lời khuyên của người khác, nhưng đừng hối hận, bởi hối hận chưa từng mang lại cho đàn ông bất cứ thứ gì hay ho.  Đàn ông thì không xé ảnh, đốt thư, xé nhật ký, làm những việc mà chỉ diễn viên ba xu trên phim truyền hình mới làm. Bởi bạn tin vào tình yêu. Tin rằng trên đời vẫn còn những người đàn ông tốt và những người phụ nữ tốt đẹp, có thể họ cũng chưa kết hôn, họ cũng vẫn đang vượt trùng trùng biển người trong đời để tìm đến bạn. Nên đừng nói những câu đại loại như: “Thời này làm gì có đàn bà tử tế” hoặc “Làm gì có đàn ông tốt!”. Những câu như thế thường làm người ta hiểu rằng, bạn đã no xôi chán chè, hời hợt với vô số người, vơ đũa cả nắm và không hề sống nghiêm túc, chưa trưởng thành.  Hãy yêu tiền, yêu vật chất, dùng tiền để sống cho ra sống. Nhưng vẫn hiểu rằng những giá trị tinh thần cũng quan trọng biết bao. Và con người bạn, một người đàn ông đầy sức sống, háo hức sống vẫn luôn có giá trị và đẹp đẽ hơn những đồng hồ hàng hiệu, thời trang, phụ kiện sành điệu bạn đang mang. Nếu đã hơn hai mươi tuổi nhưng mỗi phút bạn sống, bạn vẫn phải ngửa tay xin tiền bố mẹ, thì những tiền bạc bạn có, đồ hiệu bạn mặc chỉ làm cho sự vô liêm sỉ của bạn nổi bật hơn mà thôi. Nên đồ hiệu không làm bạn có giá hơn. Bản thân người đàn ông không có giá trị bản thân, thì dù có bọc vàng, được bố mẹ nâng đỡ sự nghiệp chức này tước kia, cũng vẫn chỉ là một kẻ ăn bám bọc vàng. Một con lừa dù có đóng yên cương vàng khối cũng không thể trở thành tuấn mã.  Bạn còn trẻ, có thể chưa đủ tuổi để bắt đầu một sự nghiệp riêng, một tương lai huy hoàng. Nhưng bạn đã đủ tuổi thành niên, nên ít nhất, cũng không thể làm một cái gánh nặng đeo trên lưng bố mẹ, để bố mẹ mất hai mươi năm nuôi dạy, cái gánh nặng đã sống ký sinh trên lưng chỉ nặng thêm và nhiều đòi hỏi hơn.  Bạn đừng tưởng bạn trẻ, bạn làm một kiểu tóc có màu khác người, mặc một bộ quần áo dở nam dở nữ Unisex, rồi phun lên người một thứ mùi nước hoa, thì người khác sẽ tôn trọng bạn. Cái ngước nhìn của người khác không mang ý trầm trồ ngưỡng mộ, mà là cái nhìn khi đi ngang qua sở thú. Rất nhiều đàn ông khác chỉ bởi họ được giáo dục tốt nên họ sẽ không bày tỏ thái độ gì với bạn đâu, họ sẽ tôn trọng sự “cá tính” của bạn, nhưng không có nghĩa rằng, họ không nhận ra sự xấu xí của người đàn ông trước mặt.  Xin bạn đừng coi rẻ những người lao động nghèo. Đừng xấu hổ vì phải làm việc nặng nhọc. Đất không bẩn, mồ hôi không hôi hám. Xin hãy tôn trọng những người có thể không giàu bằng bạn, nhưng họ đang nuôi cả gia đình bằng đôi tay lương thiện và cần cù của họ. Bạn tôn trọng họ, bạn mới biết giá trị của bạn nằm ở đâu.  Làm đàn ông, hãy tha thứ, nhưng đừng quên. Và hãy khoan dung với cả thế giới cũng như với chính bản thân bạn. Để luôn tự nhủ rằng, ta là đàn ông, ta xứng đáng để có được những thứ tốt đẹp hơn.",
  "img": "https://ngochieu.com/wp-content/uploads/2011/05/danong.jpg",
  "createdAt": {
    "$date": {
      "$numberLong": "1676283188016"
    }
  },
  "updatedAt": {
    "$date": {
      "$numberLong": "1676283188016"
    }
  },
  "slug": "neu-ban-la-dan-ong",
  "__v": 0
}]